node {
  name: "inputs"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "sequential_1/resnet50/conv1_pad/Pad"
  op: "Pad"
  input: "inputs"
  input: "sequential_1/resnet50/conv1_pad/Pad/paddings"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tpaddings"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "sequential_1/resnet50/conv1_conv/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv1_conv/Conv2D/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv1_conv/Conv2D"
  op: "Conv2D"
  input: "sequential_1/resnet50/conv1_pad/Pad"
  input: "sequential_1/resnet50/conv1_conv/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "sequential_1/resnet50/conv1_conv/BiasAdd/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv1_conv/BiasAdd/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv1_conv/BiasAdd"
  op: "BiasAdd"
  input: "sequential_1/resnet50/conv1_conv/Conv2D"
  input: "sequential_1/resnet50/conv1_conv/BiasAdd/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "sequential_1/resnet50/conv1_bn/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv1_bn/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv1_bn/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_1/resnet50/conv1_bn/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv1_bn/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv1_bn/FusedBatchNormV3/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv1_bn/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_1/resnet50/conv1_bn/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv1_bn/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "sequential_1/resnet50/conv1_conv/BiasAdd"
  input: "sequential_1/resnet50/conv1_bn/ReadVariableOp"
  input: "sequential_1/resnet50/conv1_bn/ReadVariableOp_1"
  input: "sequential_1/resnet50/conv1_bn/FusedBatchNormV3/ReadVariableOp"
  input: "sequential_1/resnet50/conv1_bn/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.0009999641624745e-05
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "sequential_1/resnet50/conv1_relu/Relu"
  op: "Relu"
  input: "sequential_1/resnet50/conv1_bn/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/pool1_pad/Pad"
  op: "Pad"
  input: "sequential_1/resnet50/conv1_relu/Relu"
  input: "sequential_1/resnet50/pool1_pad/Pad/paddings"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tpaddings"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "sequential_1/resnet50/pool1_pool/MaxPool"
  op: "MaxPool"
  input: "sequential_1/resnet50/pool1_pad/Pad"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 3
        i: 3
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_0_conv/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block1_0_conv/Conv2D/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_0_conv/Conv2D"
  op: "Conv2D"
  input: "sequential_1/resnet50/pool1_pool/MaxPool"
  input: "sequential_1/resnet50/conv2_block1_0_conv/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_0_conv/BiasAdd/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block1_0_conv/BiasAdd/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_0_conv/BiasAdd"
  op: "BiasAdd"
  input: "sequential_1/resnet50/conv2_block1_0_conv/Conv2D"
  input: "sequential_1/resnet50/conv2_block1_0_conv/BiasAdd/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_0_bn/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block1_0_bn/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_0_bn/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block1_0_bn/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_0_bn/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block1_0_bn/FusedBatchNormV3/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_0_bn/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block1_0_bn/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_0_bn/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "sequential_1/resnet50/conv2_block1_0_conv/BiasAdd"
  input: "sequential_1/resnet50/conv2_block1_0_bn/ReadVariableOp"
  input: "sequential_1/resnet50/conv2_block1_0_bn/ReadVariableOp_1"
  input: "sequential_1/resnet50/conv2_block1_0_bn/FusedBatchNormV3/ReadVariableOp"
  input: "sequential_1/resnet50/conv2_block1_0_bn/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.0009999641624745e-05
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_1_conv/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block1_1_conv/Conv2D/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_1_conv/Conv2D"
  op: "Conv2D"
  input: "sequential_1/resnet50/pool1_pool/MaxPool"
  input: "sequential_1/resnet50/conv2_block1_1_conv/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_1_conv/BiasAdd/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block1_1_conv/BiasAdd/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_1_conv/BiasAdd"
  op: "BiasAdd"
  input: "sequential_1/resnet50/conv2_block1_1_conv/Conv2D"
  input: "sequential_1/resnet50/conv2_block1_1_conv/BiasAdd/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_1_bn/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block1_1_bn/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_1_bn/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block1_1_bn/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_1_bn/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block1_1_bn/FusedBatchNormV3/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_1_bn/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block1_1_bn/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_1_bn/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "sequential_1/resnet50/conv2_block1_1_conv/BiasAdd"
  input: "sequential_1/resnet50/conv2_block1_1_bn/ReadVariableOp"
  input: "sequential_1/resnet50/conv2_block1_1_bn/ReadVariableOp_1"
  input: "sequential_1/resnet50/conv2_block1_1_bn/FusedBatchNormV3/ReadVariableOp"
  input: "sequential_1/resnet50/conv2_block1_1_bn/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.0009999641624745e-05
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_1_relu/Relu"
  op: "Relu"
  input: "sequential_1/resnet50/conv2_block1_1_bn/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_2_conv/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block1_2_conv/Conv2D/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_2_conv/Conv2D"
  op: "Conv2D"
  input: "sequential_1/resnet50/conv2_block1_1_relu/Relu"
  input: "sequential_1/resnet50/conv2_block1_2_conv/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_2_conv/BiasAdd/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block1_2_conv/BiasAdd/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_2_conv/BiasAdd"
  op: "BiasAdd"
  input: "sequential_1/resnet50/conv2_block1_2_conv/Conv2D"
  input: "sequential_1/resnet50/conv2_block1_2_conv/BiasAdd/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_2_bn/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block1_2_bn/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_2_bn/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block1_2_bn/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_2_bn/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block1_2_bn/FusedBatchNormV3/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_2_bn/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block1_2_bn/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_2_bn/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "sequential_1/resnet50/conv2_block1_2_conv/BiasAdd"
  input: "sequential_1/resnet50/conv2_block1_2_bn/ReadVariableOp"
  input: "sequential_1/resnet50/conv2_block1_2_bn/ReadVariableOp_1"
  input: "sequential_1/resnet50/conv2_block1_2_bn/FusedBatchNormV3/ReadVariableOp"
  input: "sequential_1/resnet50/conv2_block1_2_bn/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.0009999641624745e-05
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_2_relu/Relu"
  op: "Relu"
  input: "sequential_1/resnet50/conv2_block1_2_bn/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_3_conv/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block1_3_conv/Conv2D/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_3_conv/Conv2D"
  op: "Conv2D"
  input: "sequential_1/resnet50/conv2_block1_2_relu/Relu"
  input: "sequential_1/resnet50/conv2_block1_3_conv/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_3_conv/BiasAdd/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block1_3_conv/BiasAdd/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_3_conv/BiasAdd"
  op: "BiasAdd"
  input: "sequential_1/resnet50/conv2_block1_3_conv/Conv2D"
  input: "sequential_1/resnet50/conv2_block1_3_conv/BiasAdd/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_3_bn/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block1_3_bn/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_3_bn/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block1_3_bn/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_3_bn/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block1_3_bn/FusedBatchNormV3/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_3_bn/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block1_3_bn/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_3_bn/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "sequential_1/resnet50/conv2_block1_3_conv/BiasAdd"
  input: "sequential_1/resnet50/conv2_block1_3_bn/ReadVariableOp"
  input: "sequential_1/resnet50/conv2_block1_3_bn/ReadVariableOp_1"
  input: "sequential_1/resnet50/conv2_block1_3_bn/FusedBatchNormV3/ReadVariableOp"
  input: "sequential_1/resnet50/conv2_block1_3_bn/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.0009999641624745e-05
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_add/add"
  op: "AddV2"
  input: "sequential_1/resnet50/conv2_block1_0_bn/FusedBatchNormV3"
  input: "sequential_1/resnet50/conv2_block1_3_bn/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block1_out/Relu"
  op: "Relu"
  input: "sequential_1/resnet50/conv2_block1_add/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block2_1_conv/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block2_1_conv/Conv2D/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block2_1_conv/Conv2D"
  op: "Conv2D"
  input: "sequential_1/resnet50/conv2_block1_out/Relu"
  input: "sequential_1/resnet50/conv2_block2_1_conv/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block2_1_conv/BiasAdd/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block2_1_conv/BiasAdd/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block2_1_conv/BiasAdd"
  op: "BiasAdd"
  input: "sequential_1/resnet50/conv2_block2_1_conv/Conv2D"
  input: "sequential_1/resnet50/conv2_block2_1_conv/BiasAdd/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block2_1_bn/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block2_1_bn/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block2_1_bn/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block2_1_bn/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block2_1_bn/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block2_1_bn/FusedBatchNormV3/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block2_1_bn/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block2_1_bn/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block2_1_bn/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "sequential_1/resnet50/conv2_block2_1_conv/BiasAdd"
  input: "sequential_1/resnet50/conv2_block2_1_bn/ReadVariableOp"
  input: "sequential_1/resnet50/conv2_block2_1_bn/ReadVariableOp_1"
  input: "sequential_1/resnet50/conv2_block2_1_bn/FusedBatchNormV3/ReadVariableOp"
  input: "sequential_1/resnet50/conv2_block2_1_bn/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.0009999641624745e-05
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block2_1_relu/Relu"
  op: "Relu"
  input: "sequential_1/resnet50/conv2_block2_1_bn/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block2_2_conv/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block2_2_conv/Conv2D/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block2_2_conv/Conv2D"
  op: "Conv2D"
  input: "sequential_1/resnet50/conv2_block2_1_relu/Relu"
  input: "sequential_1/resnet50/conv2_block2_2_conv/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block2_2_conv/BiasAdd/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block2_2_conv/BiasAdd/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block2_2_conv/BiasAdd"
  op: "BiasAdd"
  input: "sequential_1/resnet50/conv2_block2_2_conv/Conv2D"
  input: "sequential_1/resnet50/conv2_block2_2_conv/BiasAdd/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block2_2_bn/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block2_2_bn/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block2_2_bn/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block2_2_bn/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block2_2_bn/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block2_2_bn/FusedBatchNormV3/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block2_2_bn/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block2_2_bn/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block2_2_bn/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "sequential_1/resnet50/conv2_block2_2_conv/BiasAdd"
  input: "sequential_1/resnet50/conv2_block2_2_bn/ReadVariableOp"
  input: "sequential_1/resnet50/conv2_block2_2_bn/ReadVariableOp_1"
  input: "sequential_1/resnet50/conv2_block2_2_bn/FusedBatchNormV3/ReadVariableOp"
  input: "sequential_1/resnet50/conv2_block2_2_bn/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.0009999641624745e-05
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block2_2_relu/Relu"
  op: "Relu"
  input: "sequential_1/resnet50/conv2_block2_2_bn/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block2_3_conv/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block2_3_conv/Conv2D/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block2_3_conv/Conv2D"
  op: "Conv2D"
  input: "sequential_1/resnet50/conv2_block2_2_relu/Relu"
  input: "sequential_1/resnet50/conv2_block2_3_conv/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block2_3_conv/BiasAdd/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block2_3_conv/BiasAdd/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block2_3_conv/BiasAdd"
  op: "BiasAdd"
  input: "sequential_1/resnet50/conv2_block2_3_conv/Conv2D"
  input: "sequential_1/resnet50/conv2_block2_3_conv/BiasAdd/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block2_3_bn/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block2_3_bn/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block2_3_bn/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block2_3_bn/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block2_3_bn/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block2_3_bn/FusedBatchNormV3/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block2_3_bn/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block2_3_bn/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block2_3_bn/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "sequential_1/resnet50/conv2_block2_3_conv/BiasAdd"
  input: "sequential_1/resnet50/conv2_block2_3_bn/ReadVariableOp"
  input: "sequential_1/resnet50/conv2_block2_3_bn/ReadVariableOp_1"
  input: "sequential_1/resnet50/conv2_block2_3_bn/FusedBatchNormV3/ReadVariableOp"
  input: "sequential_1/resnet50/conv2_block2_3_bn/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.0009999641624745e-05
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block2_add/add"
  op: "AddV2"
  input: "sequential_1/resnet50/conv2_block1_out/Relu"
  input: "sequential_1/resnet50/conv2_block2_3_bn/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block2_out/Relu"
  op: "Relu"
  input: "sequential_1/resnet50/conv2_block2_add/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block3_1_conv/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block3_1_conv/Conv2D/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block3_1_conv/Conv2D"
  op: "Conv2D"
  input: "sequential_1/resnet50/conv2_block2_out/Relu"
  input: "sequential_1/resnet50/conv2_block3_1_conv/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block3_1_conv/BiasAdd/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block3_1_conv/BiasAdd/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block3_1_conv/BiasAdd"
  op: "BiasAdd"
  input: "sequential_1/resnet50/conv2_block3_1_conv/Conv2D"
  input: "sequential_1/resnet50/conv2_block3_1_conv/BiasAdd/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block3_1_bn/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block3_1_bn/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block3_1_bn/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block3_1_bn/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block3_1_bn/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block3_1_bn/FusedBatchNormV3/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block3_1_bn/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block3_1_bn/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block3_1_bn/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "sequential_1/resnet50/conv2_block3_1_conv/BiasAdd"
  input: "sequential_1/resnet50/conv2_block3_1_bn/ReadVariableOp"
  input: "sequential_1/resnet50/conv2_block3_1_bn/ReadVariableOp_1"
  input: "sequential_1/resnet50/conv2_block3_1_bn/FusedBatchNormV3/ReadVariableOp"
  input: "sequential_1/resnet50/conv2_block3_1_bn/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.0009999641624745e-05
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block3_1_relu/Relu"
  op: "Relu"
  input: "sequential_1/resnet50/conv2_block3_1_bn/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block3_2_conv/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block3_2_conv/Conv2D/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block3_2_conv/Conv2D"
  op: "Conv2D"
  input: "sequential_1/resnet50/conv2_block3_1_relu/Relu"
  input: "sequential_1/resnet50/conv2_block3_2_conv/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block3_2_conv/BiasAdd/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block3_2_conv/BiasAdd/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block3_2_conv/BiasAdd"
  op: "BiasAdd"
  input: "sequential_1/resnet50/conv2_block3_2_conv/Conv2D"
  input: "sequential_1/resnet50/conv2_block3_2_conv/BiasAdd/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block3_2_bn/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block3_2_bn/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block3_2_bn/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block3_2_bn/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block3_2_bn/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block3_2_bn/FusedBatchNormV3/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block3_2_bn/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block3_2_bn/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block3_2_bn/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "sequential_1/resnet50/conv2_block3_2_conv/BiasAdd"
  input: "sequential_1/resnet50/conv2_block3_2_bn/ReadVariableOp"
  input: "sequential_1/resnet50/conv2_block3_2_bn/ReadVariableOp_1"
  input: "sequential_1/resnet50/conv2_block3_2_bn/FusedBatchNormV3/ReadVariableOp"
  input: "sequential_1/resnet50/conv2_block3_2_bn/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.0009999641624745e-05
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block3_2_relu/Relu"
  op: "Relu"
  input: "sequential_1/resnet50/conv2_block3_2_bn/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block3_3_conv/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block3_3_conv/Conv2D/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block3_3_conv/Conv2D"
  op: "Conv2D"
  input: "sequential_1/resnet50/conv2_block3_2_relu/Relu"
  input: "sequential_1/resnet50/conv2_block3_3_conv/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block3_3_conv/BiasAdd/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block3_3_conv/BiasAdd/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block3_3_conv/BiasAdd"
  op: "BiasAdd"
  input: "sequential_1/resnet50/conv2_block3_3_conv/Conv2D"
  input: "sequential_1/resnet50/conv2_block3_3_conv/BiasAdd/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block3_3_bn/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block3_3_bn/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block3_3_bn/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block3_3_bn/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block3_3_bn/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block3_3_bn/FusedBatchNormV3/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block3_3_bn/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_1/resnet50/conv2_block3_3_bn/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block3_3_bn/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "sequential_1/resnet50/conv2_block3_3_conv/BiasAdd"
  input: "sequential_1/resnet50/conv2_block3_3_bn/ReadVariableOp"
  input: "sequential_1/resnet50/conv2_block3_3_bn/ReadVariableOp_1"
  input: "sequential_1/resnet50/conv2_block3_3_bn/FusedBatchNormV3/ReadVariableOp"
  input: "sequential_1/resnet50/conv2_block3_3_bn/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.0009999641624745e-05
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block3_add/add"
  op: "AddV2"
  input: "sequential_1/resnet50/conv2_block2_out/Relu"
  input: "sequential_1/resnet50/conv2_block3_3_bn/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv2_block3_out/Relu"
  op: "Relu"
  input: "sequential_1/resnet50/conv2_block3_add/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv3_block1_0_conv/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv3_block1_0_conv/Conv2D/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv3_block1_0_conv/Conv2D"
  op: "Conv2D"
  input: "sequential_1/resnet50/conv2_block3_out/Relu"
  input: "sequential_1/resnet50/conv3_block1_0_conv/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "sequential_1/resnet50/conv3_block1_0_conv/BiasAdd/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv3_block1_0_conv/BiasAdd/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv3_block1_0_conv/BiasAdd"
  op: "BiasAdd"
  input: "sequential_1/resnet50/conv3_block1_0_conv/Conv2D"
  input: "sequential_1/resnet50/conv3_block1_0_conv/BiasAdd/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "sequential_1/resnet50/conv3_block1_0_bn/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv3_block1_0_bn/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv3_block1_0_bn/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_1/resnet50/conv3_block1_0_bn/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv3_block1_0_bn/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv3_block1_0_bn/FusedBatchNormV3/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv3_block1_0_bn/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_1/resnet50/conv3_block1_0_bn/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv3_block1_0_bn/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "sequential_1/resnet50/conv3_block1_0_conv/BiasAdd"
  input: "sequential_1/resnet50/conv3_block1_0_bn/ReadVariableOp"
  input: "sequential_1/resnet50/conv3_block1_0_bn/ReadVariableOp_1"
  input: "sequential_1/resnet50/conv3_block1_0_bn/FusedBatchNormV3/ReadVariableOp"
  input: "sequential_1/resnet50/conv3_block1_0_bn/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.0009999641624745e-05
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "sequential_1/resnet50/conv3_block1_1_conv/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv3_block1_1_conv/Conv2D/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv3_block1_1_conv/Conv2D"
  op: "Conv2D"
  input: "sequential_1/resnet50/conv2_block3_out/Relu"
  input: "sequential_1/resnet50/conv3_block1_1_conv/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "sequential_1/resnet50/conv3_block1_1_conv/BiasAdd/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv3_block1_1_conv/BiasAdd/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv3_block1_1_conv/BiasAdd"
  op: "BiasAdd"
  input: "sequential_1/resnet50/conv3_block1_1_conv/Conv2D"
  input: "sequential_1/resnet50/conv3_block1_1_conv/BiasAdd/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "sequential_1/resnet50/conv3_block1_1_bn/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv3_block1_1_bn/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv3_block1_1_bn/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_1/resnet50/conv3_block1_1_bn/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv3_block1_1_bn/FusedBatchNormV3/ReadVariableOp"
  op: "Identity"
  input: "sequential_1/resnet50/conv3_block1_1_bn/FusedBatchNormV3/ReadVariableOp/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv3_block1_1_bn/FusedBatchNormV3/ReadVariableOp_1"
  op: "Identity"
  input: "sequential_1/resnet50/conv3_block1_1_bn/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "sequential_1/resnet50/conv3_block1_1_bn/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "sequential_1/resnet50/conv3_block1_1_conv/BiasAdd"
  input: "sequential_1/resnet50/conv3_block1_1_bn/ReadVariableOp"
